local_setup/test_results/ab_with_1_dynamic_1_static
### benchmark with 1 dynamic backend


$ ab -n 10000 -c 5 http://localhost:80/
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.13.12
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        331 bytes

Concurrency Level:      5
Time taken for tests:   123.974 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      6060437 bytes
HTML transferred:       3310000 bytes
Requests per second:    80.66 [#/sec] (mean)
Time per request:       61.987 [ms] (mean)
Time per request:       12.397 [ms] (mean, across all concurrent requests)
Transfer rate:          47.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   34 187.0      0    3038
Processing:     0   28 165.2      2    3042
Waiting:        0   28 165.2      2    3042
Total:          0   62 304.8      2    4064

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      4
  95%      9
  98%   1024
  99%   2047
 100%   4064 (longest request)